Revit 2024 API
Leader.End Property
 End point of the Leader.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ End { get; set; }
Visual Basic
Public Property End As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ End {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
 The End point is the leader's end that points to the object being annotated.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: A valid point must not be father then 10 miles (approx. 16 km) from the origin. -or- When setting this property: The leader's End point may not be placed at the current position of the Anchor or Elbow point.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The leader is not currently owned by a valid element. A probable reason for that could be if the element has been independently deleted, or the leader has never been properly initialized.
See Also
Leader Class
Autodesk.Revit.DB Namespace